# ğŸ¦‰COSADAMA Introduction to Data Science Study

- ì¼ì: 2020-03-16
- ì‘ì„±ì: ë°•í•˜ëŒ 
- ì°¸ê³ ìë£Œ: íŒŒì´ì¬ ë¨¸ì‹ ëŸ¬ë‹ ì™„ë²½ê°€ì´ë“œ(ê¶Œì² ë¯¼), ë¹„ì¥¬ì–¼í”„ë¡œê·¸ë˜ë° ìˆ˜ì—…(ê¹€ìŠ¹íƒœ), íŒŒì´ì¬ìœ¼ë¡œ ë°ì´í„° ì£¼ë¬´ë¥´ê¸°(ë¯¼í˜•ê¸°)

## 1. What are NumPy, Pandas, matplotlib?

ì´ë²ˆ ì£¼ì°¨ì—ëŠ” **ìˆ˜ì¹˜ ë°ì´í„° ì²˜ë¦¬ ëª¨ë“ˆ Numpy, ë°ì´í„° ë¶„ì„ ì „ë¬¸ ëª¨ë“ˆ Pandas, ì‹œê°í™” ëª¨ë“ˆ matplotlib**ì˜ ê°„ë‹¨í•œ ë¬¸ë²•ì„ í•™ìŠµí•˜ë ¤ í•©ë‹ˆë‹¤. í”„ë¡œì íŠ¸ë¥¼ ë¨¼ì € ì‹¤ì‹œí•˜ê¸°ì— ì•ì„œ ì´ëŸ¬í•œ ëª¨ë“ˆë“¤ì„ ì–´ëŠì •ë„ í•™ìŠµí•˜ëŠ” ê²ƒì´ ì—¬ëŸ¬ë¶„ë“¤ì—ê²Œ ë” ë„ì›€ì´ ë˜ê² ë‹¤ íŒë‹¨í•˜ì—¬ ì•„ì£¼ ê°„ë‹¨í•˜ê²Œ ëª¨ë‘ë¥¼ ë‹¤ë¤„ë³´ê² ìŠµë‹ˆë‹¤.

### 1.2 ë°ì´í„° ë¶„ì„ ëíŒì™• - pandas

pandasëŠ” íŒŒì´ì¬ì—ì„œ ë°ì´í„° ì²˜ë¦¬ë¥¼ ìœ„í•´ ì¡´ì¬í•˜ëŠ” ê°€ì¥ ì¸ê¸° ìˆëŠ” ë¼ì´ë¸ŒëŸ¬ë¦¬ì…ë‹ˆë‹¤. ì¼ë°˜ì ìœ¼ë¡œ ëŒ€ë¶€ë¶„ì˜ ë°ì´í„° ì„¸íŠ¸ëŠ” 2ì°¨ì› ë°ì´í„°ì…ë‹ˆë‹¤. ì¦‰, **í–‰(row)Xì—´(column)**ìœ¼ë¡œ êµ¬ì„±ë¼ ìˆìŠµë‹ˆë‹¤.(excel ì‹œíŠ¸ë¥¼ ë– ì˜¬ë ¤ë³¼ ê²ƒ) í–‰ê³¼ ì—´ì˜ 2ì°¨ì› ë°ì´í„°ê°€ ì¸ê¸° ìˆëŠ” ì´ìœ ëŠ” ë°”ë¡œ ì¸ê°„ì´ ê°€ì¥ ì´í•´í•˜ê¸° ì‰¬ìš´ ë°ì´í„° êµ¬ì¡°ì´ë©´ì„œë„ íš¨ê³¼ì ìœ¼ë¡œ ë°ì´í„°ë¥¼ ë‹´ì„ ìˆ˜ ìˆëŠ” êµ¬ì¡°ì´ê¸° ë•Œë¬¸ì…ë‹ˆë‹¤. **íŒë‹¤ìŠ¤ëŠ” ì´ì²˜ëŸ¼ í–‰ê³¼ ì—´ë¡œ ì´ë¤„ì§„ 2ì°¨ì› ë°ì´í„°ë¥¼ íš¨ìœ¨ì ìœ¼ë¡œ ê°€ê³µ/ì²˜ë¦¬í•  ìˆ˜ ìˆëŠ” ë‹¤ì–‘í•˜ê³  í›Œë¥­í•œ ê¸°ëŠ¥ì„ ì œê³µí•©ë‹ˆë‹¤.**

ì• ì ˆì—ì„œ ë„˜íŒŒì´ë¥¼ ì†Œê°œí–ˆì§€ë§Œ, ë„˜íŒŒì´ì˜ ë°ì´í„° í•¸ë“¤ë§ì€ í¸í•˜ë‹¤ê³  ë§í•˜ê¸° ì–´ë µìŠµë‹ˆë‹¤. íŒë‹¤ìŠ¤ëŠ” ë§ì€ ë¶€ë¶„ì´ ë„˜íŒŒì´ ê¸°ë°˜ìœ¼ë¡œ ì‘ì„±ëëŠ”ë°, ë„˜íŒŒì´ë³´ë‹¤ í›¨ì”¬ ìœ ì—°í•˜ê³  í¸ë¦¬í•˜ê²Œ ë°ì´í„° í•¸ë“¤ë§ì„ ê°€ëŠ¥í•˜ê²Œ í•´ì¤ë‹ˆë‹¤. **íŒë‹¤ìŠ¤ëŠ” íŒŒì´ì¬ì˜ ë¦¬ìŠ¤íŠ¸, ì»¬ë ‰ì…˜, ë„˜íŒŒì´ ë“±ì˜ ë‚´ë¶€ ë°ì´í„° ë¿ë§Œ ì•„ë‹ˆë¼ CSV ë“±ì˜ íŒŒì¼ì„ ì‰½ê²Œ DataFrameìœ¼ë¡œ ë³€ê²½í•´ ë°ì´í„°ì˜ ê°€ê³µ/ë¶„ì„ì„ í¸ë¦¬í•˜ê²Œ ìˆ˜í–‰í•  ìˆ˜ ìˆê²Œ ë§Œë“¤ì–´ì¤ë‹ˆë‹¤.** 

íŒë‹¤ìŠ¤ê°€ íŒŒì´ì¬ ì„¸ê³„ì˜ ëŒ€í‘œì ì¸ ë°ì´í„° í•¸ë“¤ë§ í”„ë ˆì„ì›Œí¬ì§€ë§Œ, ì´ ë˜í•œ ëª¨ë“  ê²ƒì„ ë‹¤ ì •ë³µí•˜ê² ë‹¤ë¼ëŠ” ìƒê°ì„ ë²„ë¦½ì‹œë‹¤. íŒë‹¤ìŠ¤ë§Œ í•´ë„ ë³„ë„ì˜ ì±… í•œê¶Œ ë¶„ëŸ‰ì´ í•„ìš”í•˜ê±°ë“ ìš”. ì§€ê¸ˆë¶€í„° ë‹¤ë£° íŒë‹¤ìŠ¤ ë‚´ìš©ë“¤ì€ ì •ë§ë¡œ ê¸°ë³¸ ì¤‘ì˜ ê¸°ë³¸ë§Œ ë‹¤ë£¨êµ¬ë‚˜ ìƒê°í•˜ì‹œë©´ ë˜ê² ìŠµë‹ˆë‹¤. ì´ íŒŒíŠ¸ë¥¼ ë³´ì‹œê³  ìš°ë¦¬ ì£¼êµì¬ë¥¼ ë³´ì‹œë©´ ì¡°ê¸ˆ ë” ì´í•´í•˜ê¸° ì‰¬ìš¸ ê²ƒì´ë¼ ìƒê°ë©ë‹ˆë‹¤. 

#### ì¤€ë¹„ë¬¼
ì˜¤ë¥¸ìª½ ë§í¬ë¥¼ í´ë¦­í•´ ìºê¸€ ì‚¬ì´íŠ¸ì— ê°€ì…í•œ í›„, ì•„ë˜ Data Source ë€ì— ìœ„ì¹˜í•œ [ìºê¸€ì˜ íƒ€ì´íƒ€ë‹‰ train.csv](https://www.kaggle.com/c/titanic/data) ì„ ë‹¤ìš´ë°›ì•„ ìì‹ ì´ ì‹¤ìŠµí•˜ê³  ìˆëŠ” íŒŒì¼ê³¼ ê°™ì€ í´ë”ì— ë„£ì–´ë‘ê¸°

#### íŒë‹¤ìŠ¤ import í•˜ê¸°

In [1]:
import pandas as pd

#### íŒë‹¤ìŠ¤ì˜ ìë£Œêµ¬ì¡° 

- **Series**: 1ì°¨ì› ë°°ì—´ì˜ ìë£Œêµ¬ì¡°, ì¸ë±ìŠ¤ì™€ í•¨ê»˜ êµ¬ì„±ë˜ì–´ ìˆìŒ
- **DataFrame**: 2ì°¨ì› ë°°ì—´ì˜ ìë£Œêµ¬ì¡° 
- Seriesì™€ DataFrameì˜ ê°€ì¥ í° ì°¨ì´ëŠ” SeriesëŠ” ì¹¼ëŸ¼ì´ í•˜ë‚˜ë¿ì¸ ë°ì´í„° êµ¬ì¡°ì²´ì´ê³ , DataFrameì€ ì¹¼ëŸ¼ì´ ì—¬ëŸ¬ ê°œì¸ ë°ì´í„° êµ¬ì¡°ì²´ë¼ëŠ” ê²ƒ

In [2]:
# Series
obj = pd.Series([4,7,-5,3])   # ì¸ë±ìŠ¤ì™€ ê²°í•©ëœ ìë£Œ 
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
# ì¸ë±ìŠ¤ ì§€ì •ë„ ê°€ëŠ¥í•¨ 
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])
obj2   # í•­ìƒ ì–´ë–¤ ë°ì´í„°ê°€ ë“¤ì–´ìˆëŠ”ì§€ í™•ì¸í•´ë³´ëŠ” ê²ƒ ìŠì§€ë§ê¸°!

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [7]:
# ë”•ì…”ë„ˆë¦¬ì—ì„œ Series ë§Œë“¤ê¸° 
sdata = {'Ohio': 35000, 'Texas':71000,
        'Oregon':16000, 'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [8]:
# ì¸ë±ìŠ¤ë¥¼ ì´ëŸ° ì‹ìœ¼ë¡œ ì„¤ì •í•˜ëŠ” ê²ƒë„ ê°€ëŠ¥
state = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata, index=state)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

#### íŒë‹¤ìŠ¤ì˜ DataFrame

- DataFrameì€ **ì»¬ëŸ¼, ì¸ë±ìŠ¤, ë°ì´í„°** ì´ 3ê°€ì§€ë¡œ êµ¬ì„±
- ì—¬ëŸ¬ ê°œì˜ í–‰ê³¼ ì—´ë¡œ ì´ë¤„ì§„ 2ì°¨ì› ë°ì´í„°ë¥¼ ë‹´ëŠ” ë°ì´í„° êµ¬ì¡°ì²´ 
- DataFrameì€ ì—¬ëŸ¬ ê°œì˜ Seriesë¡œ ì´ë¤„ì¡Œë‹¤ê³  í•  ìˆ˜ ìˆìŒ

In [9]:
# ë”•ì…”ë„ˆë¦¬ë¥¼ ì´ìš©í•´ DataFrame ìƒì„±í•˜ê¸° 
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [10]:
# ì¹¼ëŸ¼ì„ ì›í•˜ëŠ” ìˆœì„œëŒ€ë¡œ ë³´ê¸° 
df2 = pd.DataFrame(data, columns=['year','state','pop'])
df2

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [11]:
# ì¸ë±ìŠ¤ë¥¼ ì§€ì •í•˜ê³  ì‹¶ë‹¤ë©´
df3 = pd.DataFrame(data, columns=['year','state','pop','debt'],
                  index=['one','two','three','four','five'])
df3

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

- NaN: Not a Number, ê°’ì´ ì—†ë‹¤!

#### íŒŒì¼ì„ DataFrameìœ¼ë¡œ ë¡œë”©í•˜ê¸° 

- íŒë‹¤ìŠ¤ëŠ” ë‹¤ì–‘í•œ í¬ë§·ìœ¼ë¡œ ëœ íŒŒì¼ì„ DataFrameìœ¼ë¡œ ë¡œë”©í•  ìˆ˜ ìˆëŠ” í¸ë¦¬í•œ APIë¥¼ ì œê³µí•¨. 
- **pd.read_csv('íŒŒì¼ê²½ë¡œëª…')**: CSV ë¿ë§Œ ì•„ë‹ˆë¼ ì–´ë–¤ í•„ë“œ êµ¬ë¶„ ë¬¸ì ê¸°ë°˜ì˜ íŒŒì¼ í¬ë§·ë„ DataFrameìœ¼ë¡œ ë³€í™˜ì‹œí‚´
- read_csv()ì— íŒŒì¼ê²½ë¡œë¥¼ ëª…í™•íˆ ì ì–´ì£¼ê±°ë‚˜, ê°™ì€ í´ë”ì— ë„£ì–´ì•¼ë§Œ íŒŒì¼ì´ ë¡œë”©ë¨
- íŒŒì¼ì´ë¦„ì„ ì •í™•íˆ ì ì—ˆëŠ”ì§€ í™•ì¸í•˜ì„¸ìš”!

In [12]:
titanic_df = pd.read_csv('titanic_train.csv')
titanic_df.head()  # ë°ì´í„°ê°€ ë„ˆë¬´ ë§ì„ ë•ŒëŠ” ì•ì˜ 5ê°œë§Œ

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
type(titanic_df)

pandas.core.frame.DataFrame

In [14]:
# ë’¤ì˜ 5ê°œë§Œ
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [15]:
# ì•ì˜ 10ê°œë§Œ 
titanic_df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

#### DataFrameì˜ ë°ì´í„° í•œë²ˆì— ì•Œì•„ë³´ê¸°

- DataFrameì€ ë°ì´í„°ë¿ë§Œ ì•„ë‹ˆë¼ ì¹¼ëŸ¼ì˜ íƒ€ì…, Null ë°ì´í„° ê°œìˆ˜, ë°ì´í„° ë¶„í¬ë„ ë“±ì˜ ë©”íƒ€ ë°ì´í„° ë“±ë„ ì¡°íšŒê°€ ê°€ëŠ¥í•¨.

In [16]:
# DataFrameì˜ í–‰ê³¼ ì—´ í¬ê¸° ì•Œì•„ë³´ê¸° 
titanic_df.shape

(891, 12)

ì•„í•˜! ì´ 891ê°œì˜ rowì™€ 12ê°œì˜ columnìœ¼ë¡œ ì´ë£¨ì–´ì ¸ ìˆêµ¬ë‚˜!

In [17]:
# DataFrameì˜ ì´ ë°ì´í„° ê±´ìˆ˜, ë°ì´í„° íƒ€ì…, Null ê±´ìˆ˜
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- 0 to 890: ì „ì²´ row ìˆ˜ 
- 891, 891, ... 714, ...: ì´ í–‰ì€ ê° ì¹¼ëŸ¼ì—ì„œ ëª‡ê°œì˜ ë°ì´í„°ê°€ non-nullì¸ì§€ ë‚˜íƒ€ëƒ„. ê·¸ëŸ¼ 714ê°œê°€ ìˆë‹¤ëŠ” ê±´ ë¶„ëª… ë­”ê°€ missing dataê°€ ìˆë‹¤ëŠ” ë§ì´ê² ì£ ?!
- non-null: nullê°’ì´ ì•„ë‹Œ ê²ƒ.(ê°’ì´ ìˆë‹¤ëŠ” ê²ƒ)
- objectëŠ” í¸í•˜ê²Œ íŒŒì´ì¬ì—ì„œ ë°°ìš´ ë¬¸ìì—´ì´ë¼ê³  ìƒê°í•˜ë©´ ë©ë‹ˆë‹¤.

In [18]:
# DataFrameì˜ í†µê³„ìš”ì•½ ì •ë³´ 
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

ê° ì ìœ¼ë¡œ íŒë‹¤ìŠ¤ëŠ” ì´ëŸ° ë¶€ë¶„ì— ìˆì–´ì„œ ì •ë§ ëŒ€ë°•ì´ë¼ê³  ìƒê°í•´ìš”..! **ì½”ë“œ í•˜ë‚˜ë§Œìœ¼ë¡œ ëª¨ë“  ë°ì´í„°ì˜ ìˆ˜, í‰ê· , í‘œì¤€í¸ì°¨, ìµœì†Ÿê°’, ìµœëŒ“ê°’ ë“±ì„ ëª¨ë‘ ì•Œë ¤ì£¼ì–ì•„ìš”.** 

- desribe()ëŠ” ì˜¤ì§ **ìˆ«ìí˜• ë°ì´í„°ê°’**ë§Œ ê³„ì‚°í•´ì¤ë‹ˆë‹¤. ì´ ì¹¼ëŸ¼ì´ 12ê°œì—¬ì•¼ í•˜ëŠ”ë° ë¹ ì§„ ì¹¼ëŸ¼ë“¤ì´ ë§ì´ ë³´ì´ì£ ? ê·¸ê²Œ ìˆ«ìí˜• ì¹¼ëŸ¼ì´ ì•„ë‹ˆë¼ì„œ ê³„ì‚°ì„ í•˜ì§€ ì•Šì€ ê±°ì—ìš”. ê·¸ë˜ì„œ ë°ì´í„° íƒ€ì…ì„ ì•„ëŠ” ê²ƒë„ ì¤‘ìš”í•©ë‹ˆë‹¤. 
- 25%, 50%, 75% ë“±: ì¹¼ëŸ¼ë³„ ìˆ«ìí˜• ë°ì´í„°ê°’ì˜ n-percentile ë¶„í¬ë„

In [19]:
# DataFrame ì¤‘ 'Pclass' ì¹¼ëŸ¼ë§Œ ë–¼ì–´ë³´ê¸° 
titanic_Pclass = titanic_df['Pclass']
titanic_Pclass

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [20]:
# íŠ¹ì •í•œ ì—¬ëŸ¬ê°€ì§€ ì¹¼ëŸ¼ë§Œ ë–¼ì–´ë³´ê¸° 
titanic_df[['Pclass','Age']]   # ì—¬ëŸ¬ ê°œ ì¹¼ëŸ¼ì€ [ ]ë¡œ ê°ì‹¸ì£¼ëŠ” ë²• ìŠì§€ë§ˆì„¸ìš”!

     Pclass   Age
0         3  22.0
1         1  38.0
2         3  26.0
3         1  35.0
4         3  35.0
..      ...   ...
886       2  27.0
887       1  19.0
888       3   NaN
889       1  26.0
890       3  32.0

[891 rows x 2 columns]

- **value_count()**: ë°ì´í„°ì˜ ë¶„í¬ë„ë¥¼ í™•ì¸í•˜ëŠ”ë° ìœ ìš©í•œ í•¨ìˆ˜. Series í˜•íƒœë¡œ ë°˜í™˜ë˜ë©° í•´ë‹¹ ì¹¼ëŸ¼ê°’ì˜ ìœ í˜•ê³¼ ê±´ìˆ˜ë¥¼ í™•ì¸í•  ìˆ˜ ìˆìŒ.

In [21]:
titanic_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

ì¦‰, Pclassê°€ 3ì¸ ê²ƒì´ 491ê°œ, 1ì¸ ê²ƒì´ 216ê°œ, 2ì¸ ê²ƒì´ 184ê°œ!

#### ìƒˆë¡œìš´ ì¹¼ëŸ¼ ë°ì´í„° ì„¸íŠ¸ ìƒì„±ê³¼ ìˆ˜ì •

In [22]:
# ìƒˆë¡œìš´ ì¹¼ëŸ¼ 'Age_0' ì¶”ê°€í•˜ê¸°
titanic_df['Age_0'] = 0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

ë§¨ ëì— Age_0 ì¹¼ëŸ¼ì´ ìƒê²¨ì„œ ëª¨ë‘ ê°’ì´ 0ìœ¼ë¡œ ë°”ë€ê²Œ ë³´ì´ì£ ? ì €ë ‡ê²Œ ìƒìˆ˜ë¥¼ ì ì–´ì£¼ë©´ ëª¨ë“  ë°ì´í„° ì„¸íŠ¸ì— ì¼ê´„ì ìœ¼ë¡œ ì ìš©ì´ ë˜ì–´ìš”.

In [23]:
# ê¸°ì¡´ ì¹¼ëŸ¼ì„ ì´ìš©í•´ ìƒˆë¡œìš´ ì¹¼ëŸ¼ ë§Œë“¤ê¸° 
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0

Age ì»¬ëŸ¼ì˜ ê°’ì—ë‹¤ ê³±í•˜ê¸° 10ì„ í•´ì¤€ ê°’ì„ Age_by_10 ì»¬ëŸ¼ì—ë‹¤ê°€ ë„£ì–´ì¤€ ê²ƒì´ì£ !

In [24]:
# ê¸°ì¡´ ì¹¼ëŸ¼ ê°’ë„ ì¼ê´„ì ìœ¼ë¡œ ì—…ë°ì´íŠ¸í•˜ê¸° 
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0

ì•ì„œ ë§Œë“¤ì–´ì£¼ì—ˆë˜ Age_by_10 ì¹¼ëŸ¼ì—ë‹¤ 100ì„ ë”í•´ì£¼ë©´ ì¼ê´„ì ìœ¼ë¡œ 100ì´ ë”í•´ì§„ ê²ƒì„ ë³¼ ìˆ˜ ìˆì£ .

#### DataFrame ë°ì´í„° ì‚­ì œ

- **drop()**: ì¹¼ëŸ¼ê³¼ ë¡œìš°ë¥¼ ì‚­ì œí•  ìˆ˜ ìˆëŠ” ì¤‘ìš”í•œ í•¨ìˆ˜
- DataFrame.drop(**labels=None**, **axis=0**, index=None, columns=None, level=None, **inplace=False**, errors='raise') ì´ëŸ¬í•œ íŒŒë¼ë¯¸í„°ë“¤ì„ ê°€ì§€ê³  ìˆìŠµë‹ˆë‹¤. êµµì€ ê¸€ì”¨ì²´ê°€ ì•Œì•„ì•¼ í•  íŒŒë¼ë¯¸í„°ë“¤ì´ì—ìš”. ë”°ë¡œ íŒŒë¼ë¯¸í„°ë¥¼ ë³€ê²½í•´ì£¼ì§€ ì•Šìœ¼ë©´ ì´ê²ƒì´ ê¸°ë³¸ê°’ì…ë‹ˆë‹¤.

In [25]:
# ë‚´ê°€ ì–´ë–¤ íŒŒë¼ë¯¸í„°ë“¤ì´ ìˆëŠ”ì§€ ëª¨ë¥¼ ë•ŒëŠ”? 
df.drop?

Parameters

- labels : single label or list-like
    Index or column labels to drop.
- axis : {0 or 'index', 1 or 'columns'}, default 0
    Whether to drop labels from the index (0 or 'index') or
    columns (1 or 'columns').***
- inplace : bool, default False
    If True, do operation inplace and return None.

ì´ë ‡ê²Œ íŒŒë¼ë¯¸í„°ë“¤ì´ ë­”ì§€ ì•Œ ìˆ˜ ìˆë‹µë‹ˆë‹¤. ì´ê²ƒë„ ê°ì´ ì•ˆ ì˜¨ë‹¤ë©´? 
ì•„ë˜ ì˜ˆì‹œë“¤ì„ í†µí•´ì„œ ì§ì ‘ ì‹¤ìŠµí•´ë³´ë©´ ë”ìš± ë” ë¹ ë¥´ê²Œ ìµí ìˆ˜ ìˆì–´ìš”! ì§„ì§œ ì´ê±° ë ˆì•Œ ê¿€íŒì„ğŸ’–

- labelì€ dropí•˜ê³  ì‹¶ì€ ì¹¼ëŸ¼ì´ë‚˜ ì¸ë±ìŠ¤ë¥¼ ë„£ì–´ì£¼ë©´ ë©ë‹ˆë‹¤.
- DataFrameì€ **axis=0**ì´ **row**ë¥¼ ë§í•˜ë©°, **axis=1**ì´ **column**ì„ ì˜ë¯¸í•´ìš”. drop()ì˜ defaultëŠ” axis=0ì´ì—ìš”.

In [26]:
# ì¸ë±ìŠ¤ 1ë²ˆì§¸ ì¤„ì„ ì—†ì• ì•¼ì§€
titanic_df.drop(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,450.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,450.0
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,370.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,290.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,360.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,420.0

In [27]:
# Age_0 ì¹¼ëŸ¼ì„ ì‚­ì œí•˜ê³  ì‹¶ë‹¤! ì¹¼ëŸ¼ ì‚­ì œì‹œ ë°˜ë“œì‹œ axis=1ì„ ì¶”ê°€í•´ì¤˜ì•¼ í•©ë‹ˆë‹¤.
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,450.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,450.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,370.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,290.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,360.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,420.0

In [28]:
# ë” ê°„ë‹¨í•˜ê²Œ ì´ë ‡ê²Œë„ í‘œì‹œ ê°€ëŠ¥í•©ë‹ˆë‹¤. 
titanic_drop_df = titanic_df.drop('Age_by_10', 1)
titanic_drop_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

ì–´..ì–´..ì–´? ê·¸ëŸ°ë° ì•„ë˜ë¥¼ ë³´ë‹ˆê¹Œ ë­”ê°€ê°€ ì´ìƒí•˜ì£ ?

In [29]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,450.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,450.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,370.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,290.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,360.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,420.0

ì•ì—ì„œ ë¶„ëª… Age_by_10 ì¹¼ëŸ¼ì„ ì§€ì›Œì¡ŒëŠ”ë° ì™œ titanic_dfì—ëŠ” ì´ ì¹¼ëŸ¼ì´ ì‚´ì•„ìˆì„ê¹Œìš”? 
**titanic_df.drop('Age_by_10', 1)**ì„ ë”°ë¡œ ë³€ìˆ˜ì— ë‹´ì•„ì£¼ì§€ ì•Šì•˜ê¸° ë•Œë¬¸ì´ì—ìš”! 

- ì´ê²ƒì€ **inplace íŒŒë¼ë¯¸í„°**ì™€ ê´€ë ¨ì´ ìˆì–´ìš”. dropì€ default ê°’ì´ inplace=Falseì¸ë°, ì´ê²ƒì˜ ì˜ë¯¸ëŠ” ì›ë³¸ ë°ì´í„°ëŠ” ë³€ê²½ë˜ì§€ ì•Šê³  ìƒˆë¡œ ë§Œë“¤ì–´ì¤€ ë³€ìˆ˜ì—ë‹¤ê°€ë§Œ ì ìš©ë˜ê¸° ë•Œë¬¸ì´ì—ìš”. 
- ê·¸ë˜ì„œ ì›ë³¸ ë°ì´í„°ì—ë„ ë˜‘ê°™ì€ ê²ƒì„ ì ìš©í•˜ê¸°ë¥¼ ì›í•œë‹¤ë©´ ì•„ë˜ì™€ ê°™ì´ inplace=Trueë¥¼ í•˜ë©´ ë©ë‹ˆë‹¤.

In [30]:
drop_result = titanic_df.drop(['Age_0','Age_by_10'], axis=1, inplace=True)
drop_result  # ì•„ë¬´ê²ƒë„ ë°˜í™˜ë˜ì§€ ì•ŠìŒ

In [31]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

ê·¸ëŸ¬ë‚˜ inplace=TrueëŠ” ì •ë§ ì¡°ì‹¬í•´ì„œ ì‚¬ìš©í•˜ì—¬ì•¼ í•©ë‹ˆë‹¤. 
- ì›ë³¸ ë°ì´í„°ê°€ ìœ ì‹¤ë  ìˆ˜ ìˆë‹¤ëŠ” ì ì—ì„œ ìœ„í—˜í•´ìš”. ì˜ëª» ë˜ì–´ ì¤‘ìš”í•œ ì›ë³¸ ë°ì´í„°ê°€ ì—†ì–´ì§€ë©´ ë‹¤ì‹œ ë°ì´í„°ë¥¼ ë¡œë“œí•´ì•¼ í•©ë‹ˆë‹¤. 
- í•œë²ˆ inplace=Trueë¥¼ ì‹¤í–‰í•˜ë©´ ê·¸ í›„ì—ëŠ” ì´ë¯¸ ì—¬ëŸ¬ë¶„ì´ ì§€ìš°ê¸°ë¡œ í•œ ë°ì´í„°ê°€ ì§€ì›Œì¡Œê¸° ë•Œë¬¸ì—, ë‹¤ì‹œ í•´ë‹¹ ì½”ë“œë¥¼ ì‹¤í–‰í•œë‹¤ê³  í•˜ë©´ ì˜¤ë¥˜ê°€ ëœ¨ê²Œ ë©ë‹ˆë‹¤. (ë¬´ìŠ¨ ë§ì¸ì§€ ì´í•´ê°€ ì˜ ì•ˆ ê°„ë‹¤ë©´ ê·¸ëƒ¥ just ì•„, ì´ê±´ ë”± í•œë²ˆë§Œ ì¨ì•¼ ê² êµ¬ë‚˜ ìƒê°í•˜ì„¸ìš”.) 
 
ê·¸ë˜ì„œ I would rather not using it! ì €ëŠ” ì›ë³¸ ë°ì´í„°ë¥¼ ì‚´ë¦¬ëŠ” ë°©í–¥ì„ ì„ íƒí•  ê²ƒ ê°™ìŠµë‹ˆë‹¤. (ê·¸ëŸ¬ë‚˜ ì–´ë–¤ ìƒí™©ì´ëƒì— ë”°ë¼ì„œ ë‹¬ë¼ì§ˆ ìˆ˜ ìˆì–´ìš”. ë„ˆë¬´ë‚˜ ë°ì´í„°ê°€ ë§ì•„ì„œ ë¡œë”©í•˜ëŠ”ë° ì—„ì²­ë‚œ ì‹œê°„ì´ ê±¸ë¦°ë‹¤ë©´ ì •ë§ë¡œ í•„ìš”ì—†ëŠ” ë°ì´í„°ëŠ” í™•í™• ì§€ì›Œì•¼ í•˜ëŠ” ê²½ìš°ê°€ ìƒê¸¸ ìˆ˜ë„ ìˆì£ ...!)

In [32]:
# ë‹¤ìˆ˜ì˜ ì¸ë±ìŠ¤ ì‚­ì œí•˜ê¸° 
titanic_df.drop([0,1,2])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [33]:
# ë°ì´í„°ë¥¼ ê°€ì§€ê³  ì¥ë‚œì„ ì³¤ìœ¼ë‹ˆ ë‹¤ì‹œ ë˜ëŒë ¤ ë†“ìì‹œë‹¤.
titanic_df = pd.read_csv('titanic_train.csv')
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### ë°ì´í„° ì…€ë ‰ì…˜ ë° í•„í„°ë§

In [34]:
# rowë¡œ ìŠ¬ë¼ì´ì‹±
titanic_df[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [35]:
# ë¶ˆë¦° ì¸ë±ì‹±(ì¡°ê±´ì„ ë„£ì–´ ì¸ë±ì‹±í•˜ê¸°): Pclass ì»¬ëŸ¼ ê°’ì´ 3ì¸ rowë§Œ ê°€ì ¸ì™€ë¼!
titanic_df[titanic_df['Pclass'] == 3].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

- **iloc[]**: ìœ„ì¹˜ ê¸°ë°˜ ì¸ë±ì‹±. 0ì„ ì¶œë°œì ìœ¼ë¡œ í•˜ëŠ” ê°€ë¡œì¶•, ì„¸ë¡œì¶• ì¢Œí‘œ ê¸°ë°˜ì˜ í–‰ê³¼ ì—´ ìœ„ì¹˜ë¥¼ ê¸°ë°˜ìœ¼ë¡œ ë°ì´í„°ë¥¼ ì§€ì •í•¨. ì•ì— iê°€ ë¶™ì–´ìˆìœ¼ë‹ˆ indexí•  ë•Œì˜ ië¼ ìƒê°í•˜ë©´ ë” ì‰½ê² ì£ ?
- **loc[]**: ëª…ì¹­ ê¸°ë°˜ ì¸ë±ì‹±. ì¹¼ëŸ¼ì˜ ëª…ì¹­ì„ ê¸°ë°˜ìœ¼ë¡œ ìœ„ì¹˜ë¥¼ ì§€ì •í•˜ëŠ” ë°©ì‹.
- ix[]ë¡œ í•˜ëŠ” ì¸ë±ì‹± ë°©ì‹ë„ ìˆì§€ë§Œ ì´ê²Œ ê³§ ì‚¬ë¼ì§‘ë‹ˆë‹¤. ê·¸ë˜ì„œ ìœ„ì˜ 2ê°œë¥¼ ì‚¬ìš©í•˜ëŠ” ê²ƒì´ ë” ì¢‹ê² ì£ !

In [36]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [37]:
titanic_df.iloc[0,3]

'Braund, Mr. Owen Harris'

In [38]:
titanic_df.iloc[2,8]

'STON/O2. 3101282'

In [39]:
titanic_df.loc[0,'Name']

'Braund, Mr. Owen Harris'

In [40]:
titanic_df.loc[2, 'Ticket']

'STON/O2. 3101282'

ì—¬ê¸°ì„œ ë¬¸ì œ! 

**Q. íƒ€ì´íƒ€ë‹‰ ìŠ¹ê°ë“¤ ì¤‘ ë‚˜ì´ê°€ 60ì„¸ ì´ˆê³¼ì¸ ì‚¬ëŒë“¤ì˜ ì´ë¦„ê³¼ ë‚˜ì´ë¥¼ ì•Œê³  ì‹¶ë‹¤ë©´?**

In [41]:
# ë¶ˆë¦° ì¸ë±ì‹± 
titanic_df[titanic_df['Age'] > 60][['Name', 'Age']].head()

                               Name   Age
33            Wheadon, Mr. Edward H  66.0
54   Ostby, Mr. Engelhart Cornelius  65.0
96        Goldschmidt, Mr. George B  71.0
116            Connors, Mr. Patrick  70.5
170       Van der hoef, Mr. Wyckoff  61.0

ì§„ì§œ ê¿€ì´ì£ ? íŒŒì´ì¬ í”„ë¡œê·¸ë˜ë°ë§Œìœ¼ë¡œ ì´ë ‡ê²Œ í•˜ë ¤ë©´ ì •ë§ ë§ì€ ì½”ë“œë¥¼ ì‘ì„±í•´ì•¼ í• í…ë°, ì´ê±´ ë‹¨ì§€ 1ì¤„ë¡œ ì´ë ‡ê²Œ ê°„ë‹¨í•˜ê²Œ ë§Œë“¤ì–´ë‚¼ ìˆ˜ ìˆìŠµë‹ˆë‹¤! **ë¶ˆë¦° ì¸ë±ì‹±**ì€ ë§¤ìš° í¸ë¦¬í•œ ë°ì´í„° í•„í„°ë§ ë°©ì‹ì´ì—ìš”. ì•ì„œ ë§ì”€ë“œë¦° ilocì´ë‚˜ locì„ ì‚¬ìš©í•´ ëª…í™•íˆ ì¸ë±ì‹±ì„ ì§€ì •í•˜ëŠ” ë°©ì‹ë³´ë‹¤ ë¶ˆë¦° ì¸ë±ì‹±ì— ì˜ì¡´í•´ ë°ì´í„°ë¥¼ ê°€ì ¸ì˜¤ëŠ” ê²½ìš°ê°€ ë” ë§ì•„ìš”. ê°œê¿€ë”±ì§€!

In [42]:
# loc[]ì„ í†µí•´ì„œë„ í•  ìˆ˜ ìˆì–´ìš”. 
titanic_df.loc[titanic_df['Age'] > 60, ['Name','Age']].head()

                               Name   Age
33            Wheadon, Mr. Edward H  66.0
54   Ostby, Mr. Engelhart Cornelius  65.0
96        Goldschmidt, Mr. George B  71.0
116            Connors, Mr. Patrick  70.5
170       Van der hoef, Mr. Wyckoff  61.0

ë³µí•© ì—°ì‚°ì ì¡°ê±´ : 
1. and ì¡°ê±´ì¼ ë•ŒëŠ” &
2. or ì¡°ê±´ì¼ ë•ŒëŠ” |
3. Not ì¡°ê±´ì¼ ë•ŒëŠ” ~

ì—¬ê¸°ì„œ ë‹¤ì‹œ ì§ˆë¬¸! 

**Q. ë‚˜ì´ê°€ 60ì„¸ ì´ˆê³¼ì´ê³ , ì„ ì‹¤ ë“±ê¸‰ì´ 1ë“±ê¸‰ì´ë©°, ì„±ë³„ì´ ì—¬ì„±ì¸ ìŠ¹ê° ë¦¬ìŠ¤íŠ¸ë¥¼ êµ¬í•˜ì‹œì˜¤.**

In [43]:
titanic_df[(titanic_df['Age'] > 60) 
           & (titanic_df['Pclass'] == 1) 
           & (titanic_df['Sex'] == 'female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

ì´ë ‡ê²Œ ë³µí•© ì—°ì‚°ì ì¡°ê±´ì¼ ë•ŒëŠ” ( )ë¥¼ ì‚¬ìš©í•´ì„œ ê°œë³„ ì¡°ê±´ì„ ë¬¶ì–´ì£¼ì–´ì•¼ í•©ë‹ˆë‹¤. 

ê°œë³„ ì¡°ê±´ì„ ë³€ìˆ˜ì— í• ë‹¹í•˜ê³  ì´ë“¤ ë³€ìˆ˜ë¥¼ ê²°í•©í•´ì„œ ë¶ˆë¦° ì¸ë±ì‹±ì„ ìˆ˜í–‰í•  ìˆ˜ë„ ìˆì–´ìš”.

In [44]:
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass'] == 1
cond3 = titanic_df['Sex'] == 'female'
titanic_df[cond1 & cond2 & cond3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

#### DataFrame ì •ë ¬í•˜ê¸° 

- **sort_values()** ë©”ì„œë“œë¥¼ ì´ìš©í•´ ì •ë ¬

In [45]:
# by ì•ˆì— íŠ¹ì • ì¹¼ëŸ¼ì´ë¦„ì„ ë„£ìœ¼ë©´ ê·¸ ì¹¼ëŸ¼ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.2500,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.2500,NaN,S
308,309,0,2,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
286,287,1,3,"de Mulder, Mr. Theodore",male,30.0,0,0,345774,9.5000,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5000,NaN,S
361,362,0,2,"del Carlo, Mr. Sebastiano",male,29.0,1,0,SC/PARIS 2167,27.7208,NaN,C
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S

In [46]:
# Pclassì™€ Name ê¸°ì¤€ìœ¼ë¡œ ë‚´ë¦¼ì°¨ìˆœ ì •ë ¬í•˜ê¸° 
titanic_sorted = titanic_df.sort_values(by=['Pclass','Name'], ascending=False)
titanic_sorted

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.50,0,2,A/5. 851,14.5000,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.00,0,0,345778,9.5000,NaN,S
286,287,1,3,"de Mulder, Mr. Theodore",male,30.00,0,0,345774,9.5000,NaN,S
559,560,1,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.00,1,0,345572,17.4000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
460,461,1,1,"Anderson, Mr. Harry",male,48.00,0,0,19952,26.5500,E12,S
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S

#### Aggregation í•¨ìˆ˜ ì ìš© 
- min(), max(), sum(), count() ë“±ê³¼ ê°™ì€ aggregation í•¨ìˆ˜
- ëª¨ë“  ì¹¼ëŸ¼ì— aggregationì„ ì ìš©

In [47]:
# ì–¼ë§ˆë‚˜ ë°ì´í„°ê°€ ë“¤ì–´ìˆë‚˜ìš”?
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [48]:
# ë‚˜ì´ì™€ ìš”ê¸ˆì˜ í‰ê· ì€? 
titanic_df[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

#### groupby() ì ìš©í•˜ê¸° 

- ë°ì´í„° í”„ë ˆì„ì— groupby() ì‚¬ìš© ì‹œ ì…ë ¥ íŒŒë¼ë¯¸í„° byì— ì¹¼ëŸ¼ì„ ì…ë ¥í•˜ë©´ ëŒ€ìƒ ì¹¼ëŸ¼ìœ¼ë¡œ groupby ë¨

In [49]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

Pclassê°€ ë§¨ ì™¼ìª½ìœ¼ë¡œ ì™”ì£ ? ìŠ¹ê° ë“±ê¸‰ 1,2,3ì„ ê¸°ì¤€ìœ¼ë¡œ ë‹¤ë¥¸ ì¹¼ëŸ¼ë“¤ì„ ê·¸ë£¹í•‘í•´ì¤€ ê²ƒì…ë‹ˆë‹¤. ê·¸ëŸ¬ë‹ˆê¹Œ 1ë“±ê¸‰ ì„ì— ìˆì—ˆë˜ ì‚¬ëŒë“¤ì€ 216ëª… ì‚´ì•˜ê³ , 3ë“±ê¸‰ ì„ì— ìˆì—ˆë˜ ì‚¬ëŒë“¤ì€ 491ëª… ì‚´ì•„ë‚¨ì•˜ë„¤ìš”!

In [50]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId','Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

#### ê²°ì† ë°ì´í„° ì²˜ë¦¬í•˜ê¸° 

- ê²°ì† ë°ì´í„°ëŠ” ì¹¼ëŸ¼ì— ê°’ì´ ì—†ëŠ” NULLì¸ ê²½ìš°ë¥¼ ì˜ë¯¸, ë„˜íŒŒì´ì˜ NaNìœ¼ë¡œ í‘œì‹œ 
- NaN ê°’ì€ í‰ê· , ì´í•© ë“±ì˜ í•¨ìˆ˜ ì—°ì‚° ì‹œ ì œì™¸ê°€ ë¨. 
- **isna()**ì€ NaN ì—¬ë¶€ë¥¼ í™•ì¸í•˜ê³ , **fillna()**ëŠ” NaN ê°’ì„ ë‹¤ë¥¸ ê°’ìœ¼ë¡œ ëŒ€ì²´í•¨

In [51]:
titanic_df.isna().head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False

In [52]:
# ê²°ì† ë°ì´í„°ì˜ ì´ê°œìˆ˜ êµ¬í•˜ê¸° 
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [53]:
# ê²°ì† ë°ì´í„°ë¥¼ ë‹¤ë¥¸ ê°’ìœ¼ë¡œ ëŒ€ì²´í•˜ê¸° 
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S

ì£¼ì˜í•´ì•¼ í•  ì ì€ fillna()ë¥¼ ì´ìš©í•´ ë°˜í™˜ ê°’ì„ ë‹¤ì‹œ ë°›ê±°ë‚˜ inplace=True íŒŒë¼ë¯¸í„°ë¥¼ fillna()ì— ì¶”ê°€í•´ì•¼ ì‹¤ì œ ë°ì´í„° ì„¸íŠ¸ ê°’ì´ ë³€ê²½ëœë‹¤ëŠ” ê²ë‹ˆë‹¤. ì•ì—ì„œ drop() í–ˆì„ ë•Œ ë°°ìš´ ê²ƒì²˜ëŸ¼ìš”!

In [54]:
# Age ì¹¼ëŸ¼ì˜ NaNì„ í‰ê·  ë‚˜ì´ë¡œ, Embarked ì¹¼ëŸ¼ì˜ NaNì€ 'S'ë¡œ ëŒ€ì²´ 
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

#### apply lambda ì‹ìœ¼ë¡œ ë°ì´í„° ê°€ê³µ

In [55]:
def get_square(a):
    return a**2

print('3ì˜ ì œê³±ì€:', get_square(3))

3ì˜ ì œê³±ì€: 9

íŒŒì´ì¬ í”„ë¡œê·¸ë˜ë°ì—ì„œëŠ” ì´ë ‡ê²Œ í•¨ìˆ˜ë¥¼ ì¼ì„ ê²ë‹ˆë‹¤. **lambda**ëŠ” ì´ëŸ¬í•œ í•¨ìˆ˜ì˜ ì„ ì–¸ê³¼ í•¨ìˆ˜ ë‚´ì˜ ì²˜ë¦¬ë¥¼ í•œ ì¤„ì˜ ì‹ìœ¼ë¡œ ì‰½ê²Œ ë³€í™˜í•˜ëŠ” ì‹ì…ë‹ˆë‹¤.

In [56]:
lambda_square = lambda x : x ** 2
print('3ì˜ ì œê³±ì€:', lambda_square(3))

3ì˜ ì œê³±ì€: 9

- lambda x : x ** 2

:ì˜ ì™¼ìª½ì— ìˆëŠ” xëŠ” ì…ë ¥ ì¸ìë¥¼ ê°€ë¦¬í‚¤ë©°, ì˜¤ë¥¸ìª½ì€ ì…ë ¥ ì¸ìì˜ ê³„ì‚°ì‹ì…ë‹ˆë‹¤. ê²°êµ­ ì˜¤ë¥¸ìª½ ê°’ì€ ë°˜í™˜ ê°’ì„ ì˜ë¯¸í•˜ëŠ” ê²ƒì´ì£ . 

lambda ì‹ì„ ì´ìš©í•  ë•Œ **ì—¬ëŸ¬ ê°œì˜ ê°’ì„ ì…ë ¥ ì¸ìë¡œ ì‚¬ìš©**í•´ì•¼ í•  ê²½ìš°ì—ëŠ” ë³´í†µ **map()** í•¨ìˆ˜ë¥¼ ê²°í•©í•´ì„œ ì‚¬ìš©í•©ë‹ˆë‹¤.

In [57]:
a = [1,2,3]
squares = map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

In [58]:
# Name ì¹¼ëŸ¼ì˜ ë¬¸ìì—´ ê°œìˆ˜ë¥¼ ë³„ë„ì˜ ì¹¼ëŸ¼ì¸ Name_lenì— ìƒì„±í•´ë³´ê¸° 
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x: len(x))
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_len
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,C000,S,23
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C,51
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,C000,S,22
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S,44
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,C000,S,24
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,C000,S,21
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S,28
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,C000,S,40
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C,21
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,C000,Q,19

if-elseì ˆì„ ì‚¬ìš©í•´ì„œ ë³µì¡í•œ ê°€ê³µì„ í•´ë³´ê² ìŠµë‹ˆë‹¤. 

Q. ë‚˜ì´ê°€ 15ì„¸ ë¯¸ë§Œì´ë©´ 'Child', ê·¸ë ‡ì§€ ì•Šìœ¼ë©´ 'Adult'ë¡œ êµ¬ë¶„í•˜ëŠ” ìƒˆë¡œìš´ ì¹¼ëŸ¼ 'Child_Adult'ë¥¼ apply lambdaë¡œ ë§Œë“¤ë©´?

In [60]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x: 'Child' if x <= 15 else 'Adult')
titanic_df[['Age','Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [61]:
# ë‚˜ì´ì— ë”°ë¼ ì„¸ë¶„í™”ëœ ë¶„ë¥˜ë¥¼ ìˆ˜í–‰í•˜ëŠ” í•¨ìˆ˜ ìƒì„± 
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else: cat = 'Elderly'
    
    return cat 

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult

#### ë‘ DataFrame ë³‘í•©í•˜ê¸° 

- ì£¼êµì¬ 46ìª½ì—ì„œ 53ìª½ì„ ì°¸ê³ í•˜ì‹œë©´ ë©ë‹ˆë‹¤.

In [62]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [63]:
# ë§Œë“  ë°ì´í„°ë“¤ì„ í™•ì¸í•´ë³´ëŠ” ê²ƒ ìŠì§€ë§ˆì„¸ìš”!
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [64]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [65]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

- concat(): defaultê°€ axis=0ì´ë¯€ë¡œ ì—´ë°©í–¥ìœ¼ë¡œ ë°ì´í„°ë¥¼ í•©ì¹¨

In [67]:
result = pd.concat([df1,df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [68]:
# keyë¥¼ ì§€ì •í•´ ì—¬ëŸ¬ê°œì˜ ì¸ë±ìŠ¤ë¥¼ ë§Œë“¤ ìˆ˜ ìˆìŒ
result = pd.concat([df1,df2,df3], keys=['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [69]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'], 
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [70]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [71]:
# df1ê³¼ df4ë¥¼ columnë°©í–¥ìœ¼ë¡œ í•©ì³ë´…ì‹œë‹¤
result = pd.concat([df1,df4], axis=1)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

ì™œ NaNê°€ ìƒê¸°ê²Œ ë ê¹Œìš”? **indexë¥¼ ê¸°ì¤€ìœ¼ë¡œ concat**í•˜ê¸° ë•Œë¬¸ì…ë‹ˆë‹¤. ê·¸ë˜ì„œ ê°’ì´ ì—†ëŠ” ê³³ì—ëŠ” NaNì´ ëœ¨ê²Œ ë˜ëŠ” ê²ƒì´ì£ .

In [72]:
# ê³µí†µëœ indexë¡œ í•©ì¹˜ê³  ê·¸ ì™¸ì—ëŠ” ë²„ë¦¬ê¸°
result = pd.concat([df1,df4], axis=1, join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [73]:
# df1 ì¸ë±ìŠ¤ì— ë§ì¶”ê¸°
result = pd.concat([df1,df4], axis=1, join_axes=[df1.index])
result

/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

ì–´? ê·¸ëŸ°ë° ì´ ë¶„í™ìƒ‰ì€ ë­ì£ ? FutureWarningì´ë¼ê³  ë¯¸ë˜ì— ì´ ê¸°ëŠ¥ì´ ì—†ì–´ì§„ë‹¤ëŠ” ê²ë‹ˆë‹¤. ê·¸ëŸ¼ ì´ ê¸°ëŠ¥ì„ ëŒ€ì²´í•˜ëŠ” ë‹¤ë¥¸ê²Œ ìˆë‹¤ëŠ” ê±´ë° ë­ê°€ ìˆì„ê¹Œ ê¶ê¸ˆí•˜ë©´, ë¶„í™ìƒ‰ì„ ì˜ ì½ì–´ë³´ì„¸ìš”. .reindexë¥¼ ì“°ê±°ë‚˜ .reindex_likeë¥¼ ì“°ë¼ê³  ë§í•˜ì£µ?

In [74]:
# df1 indexë¥¼ ê¸°ì¤€ìœ¼ë¡œ resultì˜ ì¸ë±ìŠ¤ë¥¼ ë§ì¶”ëŠ” ê²ƒ
result.reindex(df1.index)

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [76]:
# index ì‹¹ë‹¤ ìƒˆë¡œ ë§Œë“¤ê¸° (ê¸°ì¡´ ì¸ë±ìŠ¤ ë¬´ì‹œí•˜ê¸°)
result = pd.concat([df1,df4], ignore_index=True)
result

/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

ì—íœ´, ì´ê²ƒë„ ì—†ì–´ì§„ë‹¤ë„¤ìš”... (ì´ ì±… ì°¸ ì—…ê·¸ë ˆì´ë“œê°€ ëŠë¦°ë“¯;;)

- **merge()**: columnì„ ê¸°ì¤€ìœ¼ë¡œ í•©ì¹˜ê¸°

In [77]:
left = pd.DataFrame({'key': ['K0', 'K4', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [78]:
left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [79]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

- on ì˜µì…˜ìœ¼ë¡œ í•©ì¹˜ë©´ ê³µí†µëœ keyì— ëŒ€í•´ì„œë§Œ í•©ì¹˜ê²Œ ë©ë‹ˆë‹¤

In [80]:
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [81]:
# leftë¥¼ ê¸°ì¤€ìœ¼ë¡œ í•©ì¹˜ê¸° 
pd.merge(left, right, how='left', on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [83]:
# rightë¥¼ ê¸°ì¤€ìœ¼ë¡œ í•©ì¹˜ê¸°
pd.merge(left, right, how='right', on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K1  NaN  NaN  C1  D1

In [84]:
# í•©ì§‘í•©ì²˜ëŸ¼ ëª¨ë“  ë°ì´í„° ê²°ê³¼ ë³‘í•©í•˜ê¸° 
pd.merge(left, right, how='outer', on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

In [86]:
# êµì§‘í•©ì²˜ëŸ¼ ê³µí†µëœ ìš”ì†Œë§Œ í•©ì¹˜ê¸° 
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

ìœ¼ì—‘ìœ¼ì—‘! ë“œë””ì–´ íŒë‹¤ìŠ¤ ê¸°ì´ˆ ë¬¸ë²•ì„ ë‹¤ ì •ë¦¬í•´ë´¤ìŠµë‹ˆë‹¤. ëˆˆì•Œì´ ë¹ ì§€ëŠ”ì¤„ ì•Œì•˜ë„¤ìš”. ê·¼ë° ì´ê²ƒë„ ì •ë§ë¡œ ì ì€ ë¶„ëŸ‰ì…ë‹ˆë‹¤... ê¸°ì´ˆ ì¤‘ì˜ ê¸°ì´ˆ ë°–ì— ì•ˆ ëœë‹¤ê³ ìš”...ã… ã…  ì‚¬ì‹¤ ì˜¤ëŠ˜ ë°°ìš°ëŠ” ê²ƒë„ ì™„ë²½í•˜ê²Œ ì†Œí™”í•˜ì§€ ëª»í•˜ì‹¤ ê²ƒ ê°™ìŠµë‹ˆë‹¤. ì™œëƒë©´ ì´ê²Œ ì‹¤ì œë¡œ ë°ì´í„°ë¥¼ ë§Œì§€ë©´ì„œ ì „ì²˜ë¦¬ í•˜ë ¤ê³  í•  ë•Œ ìƒê°ì´ ì•ˆ ë‚˜ê±°ë“ ìš”. ê·¸ë˜ì„œ ì‹¤ì œ í”„ë¡œì íŠ¸ë¥¼ ì§„í–‰í•˜ë©´ì„œ ê°ê°ìœ¼ë¡œ ìµíˆëŠ” ê²ƒì´ ê°€ì¥ ë¹ ë¥¸ ë°©ë²•ì…ë‹ˆë‹¤. ì´ ì™¸ì˜ ê²ƒë“¤ì€ í•„ìš”í•  ë•Œë§ˆë‹¤ êµ¬ê¸€ë§ í•˜ê±°ë‚˜ ë”°ë¡œ ë°°ì›Œê°€ë©´ì„œ ê·¸ ë•Œ ê·¸ ë•Œ ë°°ìš°ë„ë¡ í•©ì‹œë‹¤! íŒë‹¤ìŠ¤ëŠ” 8ê°œì˜ í”„ë¡œì íŠ¸ë¥¼ ì§„í–‰í•˜ë©´ì„œ ê³„ì† ê³„ì† ê³„ì† ê³„ì† ì“¸ê±°ë‹ˆ ë”°ë¡œ ê³¼ì œëŠ” ì—†ìŠµë‹ˆë‹¤! 

ê·¸ëŸ¼ ë‹¤ìŒì—ëŠ” ì¬ë¯¸ìˆëŠ” ì‹œê°í™” matplotlibì—ì„œ ë´…ì‹œë‹¤!ğŸ¸